<a href="https://colab.research.google.com/github/lilyreynolds/OrgData/blob/master/GroupProject2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![Diagram](https://raw.githubusercontent.com/lilyreynolds/OrgData/master/GroupProject2.png)

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite:///restaurantDatabase.db

'Connected: @restaurantDatabase.db'

In [ ]:
%%sql
CREATE TABLE Entrees(Entree ID text primary key, Ethnicity text, Price real, Calories real)

 * sqlite:///restaurantDatabase.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE Customers(CustomerID text primary key, FirstName text, LastName text, PaymentType text, Entree text, Alcohol text, Waiter text)

 * sqlite:///restaurantDatabase.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE Tables(TableID text primary key, Chairs real, Booths real, Location text)

 * sqlite:///restaurantDatabase.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE Alcohol(AlcoholID text primary key, TypeofAlcohol text, Price real, Calories real, Brand text)

 * sqlite:///restaurantDatabase.db
Done.

[]

In [ ]:
%%sql
CREATE TABLE Waiters(WaitersIDNumber text primary key, Wage real, Hours real, FirstName text, LastName text, TablesTheyServe text)

 * sqlite:///restaurantDatabase.db
Done.

[]

In [ ]:
%%sql
INSERT INTO Entrees VALUES('1234','Spanish',14.99,800)

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Customers VALUES('2798','John','Doe','Cash','1234','3874','285')

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Tables VALUES('15',6,0,'Dining Room')

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Alcohol VALUES('117','Wine',8.99,120,'Barefoot')

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [ ]:
%%sql
INSERT INTO Waiters VALUES('42', 12.50, 7, 'Jimmy','Neutron','15')

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [28]:
%%sql
INSERT INTO Entrees VALUES('4321', 'Italian', 10.99, 600)

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [31]:
%%sql
SELECT AVG(Price) FROM Entrees WHERE Price < 20.00

 * sqlite:///restaurantDatabase.db
Done.

[(12.99,)]

In [16]:
%%sql
INSERT INTO Customers VALUES('5642', 'Jane', 'Doe', 'Credit', '1234', '3874', '285')

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [23]:
%%sql
SELECT DISTINCT(FirstName) FROM Customers WHERE FirstName LIKE "%J%"

 * sqlite:///restaurantDatabase.db
Done.

[('John',), ('Jane',)]

In [24]:
%%sql
INSERT INTO Waiters VALUES('12', 12.50, 8, 'Carl', 'Wheezer', '16')

 * sqlite:///restaurantDatabase.db
1 rows affected.

[]

In [26]:
%%sql
SELECT SUM(Hours) FROM Waiters WHERE Hours > 5

 * sqlite:///restaurantDatabase.db
Done.

[(15.0,)]

Question 1) SELECT AVG(Price) FROM Entrees WHERE Price < 20.00

We wanted to ask what the average price people would pay under 20 dollars would be. We did this because we wanted to see what the average person would pay coming to our restaurant that does not want to spend a lot of money. Yes, the results matched up to our expectations because the average is in the range of 12.00 dollars to 15.00 dollars, which is what we anticipated.

Question 2) SELECT DISTINCT(FirstName) FROM Customers WHERE FirstName LIKE "%J%"

For the second query, we wanted to see how many customers came into our restaurant with different names that had the letter J in it. We did this because we wanted to see the differences and similarities in names between our customers to determine who we are attracting to our restaurant. Yes, the results matched up to our expectations because the result had all names with the letter J in it and were all different from each other, which we anticipated.

Question 3) SELECT SUM(Hours) FROM Waiters WHERE Hours > 5

Finally for the third query, we wanted to determine the total amount of hours the employees worked that work on a regular basis throughout the week. We assumed most employees work more than 5 hours if they are working regularly so that is why we wanted to only calculate the sum of hours for the employees that worked more than 5 hours per week. Yes, the results matched up to our expectations because the sum of the hours worked was in the range of 14-20 hours which we assumed would be the case for the 2 active employees in our database.